Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# activeFileCloseSavingTitle
source: Saving…
ar: جارٍ الحفظ...
de: Speichern…
es: Guardando...
fr: En train de sauvegarder…
hi: सहेजना…
it: Salvataggio…
ja: 保存中…
ko: 저장 중…
nl: Opslaan…
pl: Zapisywanie…
pt: Salvando…
ru: Сохранение…
th: กำลังบันทึก...
tr: Kaydediliyor…
vi: Đang lưu…
zh_hans: 正在保存…
zh_hant: 正在儲存…

# aiChatActiveFileSwitchBlockedToastTitle
source: Stop AI generation before switching files or spaces.
ar: توقف عن توليد الذكاء الاصطناعي قبل التبديل بين الملفات أو المساحات.
de: Stoppen Sie die KI-Generierung, bevor Sie die Dateien oder Bereiche wechseln.
es: Detén la generación de IA antes de cambiar de archivos o espacios.
fr: Arrêtez la génération d'IA avant de changer de fichiers ou d'espaces.
hi: फाइलों या स्थानों को स्विच करने से पहले AI जनरेशन बंद करें।
it: Interrompi la generazione AI prima di cambiare file o spazi.
ja: ファイルやスペースを切り替える前にAI生成を停止してください。
ko: 파일이나 공간을 전환하기 전에 AI 생성을 중단하세요.
nl: Stop AI-generatie voordat je bestanden of ruimtes wisselt.
pl: Zatrzymaj generację AI przed przełączeniem plików lub przestrzeni.
pt: Pare a geração de IA antes de trocar de arquivos ou espaços.
ru: Остановите генерацию ИИ перед переключением файлов или пространств.
th: หยุดการสร้าง AI ก่อนที่จะสลับไฟล์หรือพื้นที่
tr: Dosyalara veya alanlara geçmeden önce AI üretimini durdurun.
vi: Ngừng tạo AI trước khi chuyển đổi tệp hoặc không gian.
zh_hans: 在切换文件或空间之前请停止AI生成。
zh_hant: 在切換檔案或空間之前，請停止 AI 生成。

# aiChatApprovalPanelButtonAllowAlways
source: Always
ar: دائمًا
de: Immer
es: Siempre
fr: Toujours
hi: हमेशा
it: Sempre
ja: 常に
ko: 항상
nl: Altijd
pl: Zawsze
pt: Sempre
ru: Всегда
th: ตลอดไป
tr: Her zaman
vi: Luôn luôn
zh_hans: 始终允许
zh_hant: 始終

# aiChatApprovalPanelButtonAllowOnce
source: Allow once
ar: السماح مرة واحدة
de: Einmal erlauben
es: Permitir una vez
fr: Autoriser une fois
hi: एक बार अनुमति दें
it: Consenti una volta
ja: 一度だけ許可
ko: 한 번 허용
nl: Een keer toestaan
pl: Zezwól raz
pt: Permitir uma vez
ru: Разрешить один раз
th: อนุญาตครั้งเดียว
tr: Bir kez izin ver
vi: Cho phép một lần
zh_hans: 允许一次
zh_hant: 允許一次

# aiChatApprovalPanelButtonDeny
source: Deny
ar: رفض
de: Ablehnen
es: Denegar
fr: Refuser
hi: अस्वीकृत करें
it: Negare
ja: 拒否
ko: 거부
nl: Weigeren
pl: Odmów
pt: Negar
ru: Отказать
th: ปฏิเสธ
tr: Reddet
vi: Từ chối
zh_hans: 拒绝
zh_hant: 拒絕

# aiChatApprovalPanelCancelTips
source: Esc to cancel
ar: اضغط على Esc للإلغاء
de: Esc zum Abbrechen
es: Esc para cancelar
fr: Échap pour annuler
hi: रद्द करने के लिए Esc दबाएं
it: Esc per annullare
ja: キャンセルするにはEscを押してください
ko: 취소하려면 Esc
nl: Esc om te annuleren
pl: Esc, aby anulować
pt: Esc para cancelar
ru: Esc для отмены
th: กด Esc เพื่อยกเลิก
tr: İptal için Esc tuşuna basın
vi: Nhấn Esc để hủy
zh_hans: 按 Esc 取消
zh_hant: 按 Esc 取消

# aiChatApprovalPanelDenyTextFieldPlaceholder
source: Tell the AI why (optional, then ⏎)
ar: أخبر الذكاء الاصطناعي لماذا (اختياري، ثم ⏎)
de: Erzähle der KI warum (optional, dann ⏎)
es: Dile a la IA por qué (opcional, luego ⏎)
fr: Dites à l'IA pourquoi (facultatif, puis ⏎)
hi: AI को क्यों बताएं (वैकल्पिक, फिर ⏎)
it: Dì all'AI perché (opzionale, poi ⏎)
ja: AIに理由を伝えてください（任意、次に⏎を押す）
ko: AI에게 이유를 말해주세요 (선택 사항, ⏎ 누르기)
nl: Vertel de AI waarom (optioneel, daarna ⏎)
pl: Powiedz AI dlaczego (opcjonalnie, następnie ⏎)
pt: Diga ao AI por quê (opcional, depois ⏎)
ru: Скажите ИИ, почему (по желанию, затем ⏎)
th: บอก AI ว่าทำไม (ไม่บังคับ, แล้ว ⏎)
tr: Yapay zekaya nedenini söyle (isteğe bağlı, sonra ⏎)
vi: Nói cho AI lý do (tùy chọn, sau đó nhấn ⏎)
zh_hans: 告诉 AI 原因（可选，然后按 ⏎）
zh_hant: 告訴 AI 原因（可選，然後按 ⏎）

# aiChatApprovalPanelTitle
source: Approval required
ar: الموافقة مطلوبة
de: Genehmigung erforderlich
es: Aprobación requerida
fr: Approbation requise
hi: अनुमति आवश्यक
it: Approvazione richiesta
ja: 承認が必要
ko: 승인이 필요합니다
nl: Goedkeuring vereist
pl: Wymagana akceptacja
pt: Aprovação necessária
ru: Требуется одобрение
th: ต้องการการอนุมัติ
tr: Onay gerekli
vi: Cần sự chấp thuận
zh_hans: 需要批准
zh_hant: 需要批准

# aiChatButtonAIVisibility
source: AI Visibility
ar: رؤية الذكاء الاصطناعي
de: KI-Sichtbarkeit
es: Visibilidad de IA
fr: Visibilité IA
hi: एआई दृश्यता
it: Visibilità AI
ja: AIの可視性
ko: AI 가시성
nl: AI Zichtbaarheid
pl: Widoczność AI
pt: Visibilidade AI
ru: Видимость ИИ
th: การมองเห็น AI
tr: AI Görünürlüğü
vi: Nhìn thấy AI
zh_hans: AI 可见性
zh_hant: AI 可見性

# aiChatButtonClearChat
source: Clear chat
ar: مسح الدردشة
de: Chat löschen
es: Borrar chat
fr: Effacer le chat
hi: चैट साफ करें
it: Cancella chat
ja: チャットをクリア
ko: 채팅 지우기
nl: Chat wissen
pl: Wyczyść czat
pt: Limpar chat
ru: Очистить чат
th: ล้างแชท
tr: Sohbeti temizle
vi: Xóa trò chuyện
zh_hans: 清除聊天
zh_hant: 清除聊天

# aiChatButtonCompactContext
source: Compact Context
ar: السياق المدمج
de: Kompakter Kontext
es: Contexto Compacto
fr: Contexte compact
hi: संक्षिप्त संदर्भ
it: Contesto Compatto
ja: コンパクトコンテキスト
ko: 간결한 컨텍스트
nl: Compacte Context
pl: Kontekst Kompaktowy
pt: Contexto Compacto
ru: Компактный контекст
th: บริบทแบบย่อ
tr: Kompakt Bağlam
vi: Ngữ cảnh gọn nhẹ
zh_hans: 紧凑上下文
zh_hant: 緊湊上下文

# aiChatButtonCreditsCount
source: %@ credits
ar: %@ أرصدة
es: %@ créditos
fr: %@ crédits
hi: %@ क्रेडिट
it: %@ crediti
ja: %@ クレジット
ko: %@ 크레딧
pl: %@ kredytów
pt: %@ créditos
ru: %@ кредиты
th: %@ เครดิต
tr: %@ kredi
vi: %@ tín dụng
zh_hans: %@ 积分
zh_hant: %@ 積分

# aiChatButtonFullscreen
source: Fullscreen
ar: ملء الشاشة
de: Vollbild
es: Pantalla Completa
fr: Plein écran
hi: पूर्ण स्क्रीन
it: A schermo intero
ja: 全画面表示
ko: 전체 화면
nl: Volledig scherm
pl: Pełny Ekran
pt: Tela Cheia
ru: Полноэкранный режим
th: เต็มหน้าจอ
tr: Tam Ekran
vi: Toàn màn hình
zh_hans: 全屏
zh_hant: 全螢幕

# aiChatButtonInspectMode
source: Dock back to inspector
ar: رجوع إلى وضع المفتش
de: Zurück zum Inspektor docken
es: Acoplar de vuelta al inspector
fr: Dock vers l'inspecteur
hi: इंस्पेक्टर में वापस डोक करें
it: Agganciare di nuovo all'ispezione
ja: インスペクタにドッキング
ko: 검사기에게 다시 도킹
nl: Dock terug naar inspector
pl: Przymocuj z powrotem do inspektora
pt: Acoplar de volta ao inspetor
ru: Вернуться к инспектору
th: กลับไปยังโหมดตรวจสอบ
tr: Denetleyiciye geri sabitle
vi: Dock lại về chế độ xem
zh_hans: 回到检查器
zh_hant: 回到檢查器

# aiChatButtonIslandMode
source: Island mode
ar: وضع الجزيرة
de: Inselmodus
es: Modo isla
fr: Mode île
hi: आइसलैंड मोड
it: Modalità isola
ja: アイランドモード
ko: 아일랜드 모드
nl: Eilandmodus
pl: Tryb wyspy
pt: Modo ilha
ru: Режим острова
th: โหมดเกาะ
tr: Ada modu
vi: Chế độ đảo
zh_hans: 岛屿模式
zh_hant: 島嶼模式

# aiChatButtonIslandModeHelp
source: Float chat as a draggable island over the editor
ar: عارض الدردشة كجزيرة قابلة للسحب فوق المحرر
de: Chat als ziehbare Insel über dem Editor schwebend
es: Flotar el chat como una isla desplazable sobre el editor
fr: Flottez le chat comme une île draggable au-dessus de l'éditeur
hi: संपादक के ऊपर एक खींचने योग्य आइसलैंड के रूप में चैट को तैराएं
it: Fluttua la chat come un'isola trascinabile sopra l'editor
ja: エディタの上にドラッグ可能なアイランドとしてチャットを浮かせる
ko: 편집기 위에 드래그 가능한 아일랜드로 채팅 띄우기
nl: Druk chat als een sleepbare eiland boven de editor
pl: Pływający czat jako przeciągalna wyspa nad edytorem
pt: Flutue o chat como uma ilha arrastável sobre o editor
ru: Плавающий чат как перетаскиваемый остров над редактором
th: ทำให้แชทลอยได้เป็นเกาะที่สามารถลากไปเหนือโปรแกรมแก้ไข
tr: Sohbeti editör üzerinde sürüklenebilir bir ada olarak aç
vi: Nổi trò chuyện như một hòn đảo có thể kéo thả qua trình chỉnh sửa
zh_hans: 将聊天窗口浮动为可拖动的岛屿，悬浮在编辑器上方
zh_hant: 將聊天視窗漂浮為可拖曳的島嶼在編輯器上方

# aiChatButtonRemoveAttachment
source: Remove attachment
ar: إزالة المرفق
de: Anhang entfernen
es: Eliminar adjunto
fr: Retirer la pièce jointe
hi: संलग्नक हटाएं
it: Rimuovi allegato
ja: 添付ファイルを削除
ko: 첨부파일 제거
nl: Verwijder bijlage
pl: Usuń załącznik
pt: Remover anexo
ru: Удалить вложение
th: ลบไฟล์แนบ
tr: Eklemeyi kaldır
vi: Xóa tệp đính kèm
zh_hans: 移除附件
zh_hant: 移除附件

# aiChatButtonShowWelcome
source: Show welcome
ar: عرض الترحيب
de: Willkommen anzeigen
es: Mostrar bienvenida
fr: Afficher l'accueil
hi: स्वागत दिखाएं
it: Mostra benvenuto
ja: ウェルカムを表示
ko: 환영 메시지 보기
nl: Toon welkom
pl: Pokaż powitanie
pt: Mostrar boas-vindas
ru: Показать приветствие
th: แสดงการต้อนรับ
tr: Hoş geldiniz göster
vi: Hiện thông báo chào mừng
zh_hans: 显示欢迎
zh_hant: 顯示歡迎

# aiChatClearChatConfimationDialogMessage
source: All messages in this conversation will be removed. The drawing file is unaffected.
ar: سيتم إزالة جميع الرسائل في هذه المحادثة. ملف الرسم غير متأثر.
de: Alle Nachrichten in diesem Gespräch werden entfernt. Die Zeichnungsdatei bleibt unberührt.
es: Todos los mensajes en esta conversación serán eliminados. El archivo de dibujo no se verá afectado.
fr: Tous les messages de cette conversation seront supprimés. Le fichier de dessin reste inchangé.
hi: इस बातचीत में सभी संदेश हटा दिए जाएंगे। चित्र फ़ाइल अप्रभावित रहेगी।
it: Tutti i messaggi in questa conversazione verranno rimossi. Il file di disegno non ne sarà influenzato.
ja: この会話のすべてのメッセージが削除されます。描画ファイルには影響しません。
ko: 이 대화의 모든 메시지가 제거됩니다. 드로잉 파일에는 영향을 주지 않습니다.
nl: Alle berichten in dit gesprek worden verwijderd. Het tekenbestand blijft onaangetast.
pl: Wszystkie wiadomości w tej rozmowie zostaną usunięte. Plik rysunku nie zostanie naruszony.
pt: Todas as mensagens nesta conversa serão removidas. O arquivo de desenho não será afetado.
ru: Все сообщения в этом разговоре будут удалены. Файл рисования останется без изменений.
th: ข้อความทั้งหมดในสนทนานี้จะถูกลบ ไฟล์วาดไม่ถูกกระทบ
tr: Bu konuşmadaki tüm mesajlar silinecek. Çizim dosyası etkilenmeyecek.
vi: Tất cả tin nhắn trong cuộc trò chuyện này sẽ bị xóa. Tệp vẽ sẽ không bị ảnh hưởng.
zh_hans: 此对话中的所有消息将被移除。绘图文件不受影响。
zh_hant: 此對話中的所有消息將被移除。繪圖文件不受影響。

# aiChatClearChatConfimationDialogTitle
source: Clear chat?
ar: محو الدردشة؟
de: Chat löschen?
es: ¿Borrar chat?
fr: Effacer le chat ?
hi: चैट साफ करें?
it: Cancellare la chat?
ja: チャットをクリアしますか？
ko: 채팅을 지울까요?
nl: Chat wissen?
pl: Wyczyścić czat?
pt: Limpar chat?
ru: Очистить чат?
th: ล้างแชทหรือไม่?
tr: Sohbeti temizleyelim mi?
vi: Có chắc chắn xóa trò chuyện không?
zh_hans: 清除聊天？
zh_hant: 清除聊天？

# aiChatCompactIndicatorLabel
source: Compacting context…
ar: جارٍ ضغط السياق...
de: Kontext wird verkleinert…
es: Compactando contexto…
fr: Compactage du contexte…
hi: संदर्भ में संकुचन…
it: Compattamento del contesto…
ja: 文脈を圧縮中…
ko: 문맥 압축 중…
nl: Context aan het samenvoegen…
pl: Kompaktowanie kontekstu…
pt: Compactando contexto…
ru: Сжатие контекста…
th: กำลังบีบอัดบริบท…
tr: Bağlamı sıkıştırma...
vi: Đang thu gọn ngữ cảnh…
zh_hans: 正在压缩上下文…
zh_hant: 壓縮上下文中...

# aiChatCompactSummaryHeadline
source: Earlier conversation
ar: المحادثة السابقة
de: Frühere Unterhaltung
es: Conversación anterior
fr: Conversation précédente
hi: पहली बातचीत
it: Conversazione precedente
ja: 以前の会話
ko: 이전 대화
nl: Eerdere conversatie
pl: Poprzednia rozmowa
pt: Conversa anterior
ru: Предыдущий разговор
th: การสนทนาก่อนหน้า
tr: Önceki sohbet
vi: Cuộc trò chuyện trước đó
zh_hans: 早期对话
zh_hant: 早前的對話

# aiChatContextUsageHelp
source: %@ of context used before auto-compact.\nClick to compact now
ar: %@ من السياق المستخدم قبل الضغط التلقائي.\nاضغط للضغط الآن
de: %@ des Kontexts vor automatischer Verdichtung verwendet.\nKlicken Sie jetzt, um zu verdichten.
es: %@ de contexto utilizado antes de la compactación automática.\nHaz clic para compactar ahora
fr: %@ de contexte utilisé avant l’auto-compactage. Cliquez pour compacter maintenant
hi: %@ संदर्भ का उपयोग ऑटो-संकुचन से पहले।\nअब संकुचन के लिए क्लिक करें
it: %@ del contesto utilizzato prima del compattamento automatico.\nClicca per compattare ora
ja: %@ の文脈が自動圧縮の前に使用されました。\n今すぐ圧縮するにはクリックしてください
ko: %@의 문맥이 자동 압축 전에 사용되었습니다.\n지금 압축하려면 클릭하세요.
nl: %@ van de context gebruikt voor auto-samenvoegen.\nKlik om nu samen te voegen
pl: %@ użytego kontekstu przed automatycznym kompresowaniem.\nKliknij, aby skompaktować teraz
pt: %@ de contexto utilizado antes da compactação automática.\nClique para compactar agora
ru: %@ контекста использовано до авто-сжатия.\nНажмите, чтобы сжать сейчас
th: %@ ของบริบทที่ใช้ก่อนการบีบอัดอัตโนมัติ. คลิกเพื่อบีบอัดตอนนี้
tr: %@ otomatik sıkıştırmadan önce kullanılan bağlam.\nŞimdi sıkıştırmak için tıklayın
vi: %@ ngữ cảnh đã sử dụng trước khi tự động thu gọn.\nNhấn để thu gọn ngay
zh_hans: %@ 的上下文已被使用，自动压缩前请点击压缩。
zh_hant: 已使用%@的上下文，將自動壓縮。\n點擊立即壓縮

# aiChatContextUsageTitle
source: Context usage
ar: استخدام السياق
de: Kontextnutzung
es: Uso del contexto
fr: Utilisation du contexte
hi: संदर्भ का उपयोग
it: Utilizzo del contesto
ja: 文脈の使用量
ko: 문맥 사용량
nl: Contextgebruik
pl: Użycie kontekstu
pt: Uso do contexto
ru: Использование контекста
th: การใช้บริบท
tr: Bağlam kullanımı
vi: Sử dụng ngữ cảnh
zh_hans: 上下文使用情况
zh_hant: 上下文用量

# aiChatDisabledButtonEnable
source: Enable AI Features
ar: تفعيل ميزات الذكاء الاصطناعي
de: AI-Funktionen aktivieren
es: Habilitar funciones de IA
fr: Activer les fonctionnalités AI
hi: AI सुविधाएँ सक्षम करें
it: Abilita le funzionalità AI
ja: AI機能を有効にする
ko: AI 기능 활성화
nl: Schakel AI-functies in
pl: Włącz funkcje AI
pt: Ativar recursos de IA
ru: Включить функции ИИ
th: เปิดใช้งานฟีเจอร์ AI
tr: AI Özelliklerini Etkinleştir
vi: Bật tính năng AI
zh_hans: 启用AI功能
zh_hant: 啟用 AI 功能

# aiChatDisabledMessage
source: AI features are off. ExcalidrawZ will not send AI requests or refresh AI account data until you enable them.
ar: ميزاته الذكاء الاصطناعي غير مفعلة. لن تقوم ExcalidrawZ بإرسال طلبات الذكاء الاصطناعي أو تحديث بيانات حساب الذكاء الاصطناعي إلا بعد تفعيلها.
de: AI-Funktionen sind deaktiviert. ExcalidrawZ wird keine AI-Anfragen senden oder AI-Kontodaten aktualisieren, bis Sie sie aktivieren.
es: Las funciones de IA están desactivadas. ExcalidrawZ no enviará solicitudes de IA ni actualizará los datos de la cuenta de IA hasta que las habilites.
fr: Les fonctionnalités AI sont désactivées. ExcalidrawZ n'enverra pas de demandes AI ni ne mettra à jour les données de compte AI tant que vous ne les aurez pas activées.
hi: AI सुविधाएँ बंद हैं। ExcalidrawZ AI अनुरोध नहीं भेजेगा या AI खाता डेटा को ताज़ा नहीं करेगा जब तक कि आप उन्हें सक्षम न करें।
it: Le funzionalità AI sono disattivate. ExcalidrawZ non invierà richieste AI né aggiornerà i dati dell'account AI finché non le abiliti.
ja: AI機能はオフです。ExcalidrawZはAIリクエストを送信したり、AIアカウントデータを更新したりすることはありません。
ko: AI 기능이 꺼져 있습니다. ExcalidrawZ는 AI 요청을 전송하거나 AI 계정 데이터를 새로 고치지 않습니다. 기능을 활성화하십시오.
nl: AI-functies zijn uitgeschakeld. ExcalidrawZ zal geen AI-aanvragen versturen of AI-accountgegevens vernieuwen totdat je ze inschakelt.
pl: Funkcje AI są wyłączone. ExcalidrawZ nie będzie wysyłać zapytań do AI ani odświeżać danych konta AI, dopóki ich nie włączysz.
pt: Os recursos de IA estão desligados. O ExcalidrawZ não enviará solicitações de IA nem atualizará os dados da conta de IA até que você os ative.
ru: Функции ИИ отключены. ExcalidrawZ не будет отправлять запросы ИИ или обновлять данные учетной записи ИИ, пока вы не включите их.
th: ฟีเจอร์ AI ปิดอยู่ ExcalidrawZ จะไม่ส่งคำขอ AI หรือรีเฟรชข้อมูลบัญชี AI จนกว่าคุณจะเปิดใช้งาน
tr: AI özellikleri kapalı. ExcalidrawZ, AI isteklerini göndermeyecek veya AI hesap verilerini yenilemeyecek, ta ki onları etkinleştirin.
vi: Các tính năng AI đã tắt. ExcalidrawZ sẽ không gửi yêu cầu AI hoặc làm mới dữ liệu tài khoản AI cho đến khi bạn bật chúng.
zh_hans: AI功能已关闭。ExcalidrawZ不会发送AI请求或刷新AI帐户数据，直到您启用它们。
zh_hant: AI 功能已關閉。ExcalidrawZ 將不會發送 AI 請求或更新 AI 帳戶數據，直到您啟用它們。

# aiChatEditingMessageBannerText
source: Editing message
ar: تحرير الرسالة
de: Nachricht wird bearbeitet
es: Editando mensaje
fr: Modifier le message
hi: संदेश संपादित कर रहे हैं
it: Modifica messaggio
ja: メッセージを編集中
ko: 메시지 편집 중
nl: Bericht bewerken
pl: Edycja wiadomości
pt: Editar mensagem
ru: Редактирование сообщения
th: กำลังแก้ไขข้อความ
tr: Mesaj düzenleniyor
vi: Đang chỉnh sửa tin nhắn
zh_hans: 正在编辑消息
zh_hant: 編輯訊息

# aiChatEmptyContentPlaceholderDescription
source: Ask questions about your diagrams or get help with Excalidraw features.
ar: اطرح أسئلة حول المخططات الخاصة بك أو احصل على مساعدة بشأن ميزات Excalidraw.
de: Stellen Sie Fragen zu Ihren Diagrammen oder erhalten Sie Hilfe bei den Funktionen von Excalidraw.
es: Haz preguntas sobre tus diagramas o recibe ayuda con las funciones de Excalidraw.
fr: Posez des questions sur vos diagrammes ou obtenez de l'aide sur les fonctionnalités d'Excalidraw.
hi: अपने आरेखों के बारे में प्रश्न पूछें या Excalidraw सुविधाओं में मदद प्राप्त करें।
it: Fai domande sui tuoi diagrammi o chiedi aiuto con le funzionalità di Excalidraw.
ja: 図面に関する質問をしたり、Excalidrawの機能についてのヘルプを受けたりしてください。
ko: 다이어그램에 대한 질문을 하거나 Excalidraw 기능에 대한 도움이 필요합니다.
nl: Stel vragen over je diagrammen of krijg hulp bij Excalidraw-functies.
pl: Zadawaj pytania dotyczące swoich diagramów lub uzyskuj pomoc w funkcjach Excalidraw.
pt: Faça perguntas sobre seus diagramas ou obtenha ajuda com os recursos do Excalidraw.
ru: Задайте вопросы о своих диаграммах или получите помощь с функциями Excalidraw.
th: ถามคำถามเกี่ยวกับไดอะแกรมของคุณหรือขอความช่วยเหลือเกี่ยวกับฟีเจอร์ของ Excalidraw
tr: Diyagramlarınız hakkında sorular sorun veya Excalidraw özellikleriyle ilgili yardım alın.
vi: Hãy đặt câu hỏi về các sơ đồ của bạn hoặc nhận trợ giúp với các tính năng của Excalidraw.
zh_hans: 询问有关您的图表的问题或获取 Excalidraw 功能的帮助。
zh_hant: 請詢問有關您圖表的問題或獲取Excalidraw功能的幫助。

# aiChatEmptyContentPlaceholderTitle
source: AI Chat Assistant
ar: مساعد الدردشة بالذكاء الاصطناعي
de: AI-Chat-Assistent
es: Asistente de chat AI
fr: Assistant de chat AI
hi: AI चैट सहायक
it: Assistente Chat AI
ja: AIチャットアシスタント
ko: AI 채팅 비서
nl: AI Chat Assistent
pl: Asystent czatu AI
pt: Assistente de Chat AI
th: ผู้ช่วยแชท AI
tr: AI Sohbet Asistanı
vi: Trợ lý trò chuyện AI
zh_hans: AI 聊天助手
zh_hant: AI 聊天助手

# aiChatEnableConfirmationButtonEnable
source: Enable AI
ar: تفعيل الذكاء الاصطناعي
de: AI aktivieren
es: Habilitar IA
fr: Activer l'AI
hi: AI सक्षम करें
it: Abilita AI
ja: AIを有効にする
ko: AI 활성화
nl: Schakel AI in
pl: Włącz AI
pt: Ativar IA
ru: Включить ИИ
th: เปิดใช้งาน AI
tr: AI’yi Etkinleştir
vi: Bật AI
zh_hans: 启用AI
zh_hant: 啟用 AI

# aiChatEnableConfirmationMessage
source: AI is a cloud feature. When you use it, your prompt, relevant canvas content, tool results, and attached images may be sent to ExcalidrawZ AI services and third-party model providers such as OpenAI, Anthropic, and Google, depending on the selected model.
ar: الذكاء الاصطناعي ميزة سحابية. عند استخدامه، قد يتم إرسال طلبك، ومحتوى اللوحة المعني، ونتائج الأدوات، والصور المرفقة إلى خدمات الذكاء الاصطناعي الخاصة بـ ExcalidrawZ ومقدمي نماذج طرف ثالث مثل OpenAI وAnthropic وGoogle، اعتمادًا على النموذج المختار.
de: AI ist ein Cloud-Feature. Wenn Sie es verwenden, können Ihr Prompt, relevante Canvas-Inhalte, Tool-Ergebnisse und angehängte Bilder an die ExcalidrawZ AI-Dienste und Drittanbieter wie OpenAI, Anthropic und Google, je nach ausgewähltem Modell, gesendet werden.
es: La IA es una función en la nube. Cuando la uses, tu solicitud, el contenido relevante del lienzo, los resultados de las herramientas y las imágenes adjuntas pueden ser enviados a los servicios de IA de ExcalidrawZ y a proveedores de modelos de terceros como OpenAI, Anthropic y Google, dependiendo del modelo seleccionado.
fr: L'AI est une fonctionnalité cloud. Lorsque vous l'utilisez, votre prompt, le contenu pertinent du canvas, les résultats des outils et les images jointes peuvent être envoyés aux services AI d'ExcalidrawZ et aux fournisseurs de modèles tiers tels qu'OpenAI, Anthropic et Google, en fonction du modèle sélectionné.
hi: AI एक क्लाउड सुविधा है। जब आप इसका उपयोग करते हैं, तो आपका प्रॉम्प्ट, संबंधित कैनवास सामग्री, उपकरण परिणाम, और अटैच की गई छवियाँ ExcalidrawZ AI सेवाओं और तृतीय पक्ष मॉडल प्रदाताओं जैसे OpenAI, Anthropic, और Google को भेजी जा सकती हैं, जो चयनित मॉडल पर निर्भर करती हैं।
it: L'AI è una funzionalità cloud. Quando la usi, il tuo prompt, il contenuto pertinente della tela, i risultati degli strumenti e le immagini allegate possono essere inviati ai servizi AI di ExcalidrawZ e ai fornitori di modelli di terze parti come OpenAI, Anthropic e Google, a seconda del modello selezionato.
ja: AIはクラウド機能です。使用する際、プロンプト、関連するキャンバスの内容、ツールの結果、添付画像が選択したモデルに応じてExcalidrawZ AIサービスおよびOpenAI、Anthropic、Googleなどのサードパーティモデルプロバイダーに送信される可能性があります。
ko: AI는 클라우드 기능입니다. 사용하는 동안 귀하의 프롬프트, 관련 캔버스 콘텐츠, 도구 결과 및 첨부된 이미지는 선택된 모델에 따라 ExcalidrawZ AI 서비스 및 OpenAI, Anthropic, Google과 같은 제3자 모델 제공업체에 전송될 수 있습니다.
nl: AI is een cloudfunctie. Wanneer je het gebruikt, kunnen je prompt, relevante canvasinhoud, toolresultaten en bijgevoegde afbeeldingen naar ExcalidrawZ AI-diensten en externe modelproviders zoals OpenAI, Anthropic en Google worden gestuurd, afhankelijk van het geselecteerde model.
pl: AI jest funkcją w chmurze. Kiedy z niej korzystasz, twój prompt, istotna zawartość kanwy, wyniki narzędzi i załączone obrazy mogą być wysyłane do usług AI ExcalidrawZ oraz zewnętrznych dostawców modeli, takich jak OpenAI, Anthropic i Google, w zależności od wybranego modelu.
pt: A IA é um recurso em nuvem. Quando você a usa, seu prompt, conteúdo relevante do canvas, resultados de ferramentas e imagens anexadas podem ser enviados para os serviços de IA do ExcalidrawZ e fornecedores de modelos de terceiros, como OpenAI, Anthropic e Google, dependendo do modelo selecionado.
ru: ИИ — это облачная функция. Когда вы используете ее, ваш запрос, соответствующее содержимое холста, результаты инструментов и прикрепленные изображения могут быть отправлены в службы ExcalidrawZ AI и сторонним поставщикам моделей, таким как OpenAI, Anthropic и Google, в зависимости от выбранной модели.
th: AI เป็นฟีเจอร์คลาวด์ เมื่อคุณใช้ฟีเจอร์นี้ คำสั่งที่คุณส่ง ข้อมูลแคนวาสที่เกี่ยวข้อง ผลลัพธ์จากเครื่องมือ และภาพที่แนบมาจะถูกส่งไปยังบริการ AI ของ ExcalidrawZ และผู้ให้บริการโมเดลบุคคลที่สาม เช่น OpenAI, Anthropic และ Google ขึ้นอยู่กับโมเดลที่เลือก
tr: AI, bir bulut özelliğidir. Kullanırken, isteğiniz, ilgili tuval içeriği, araç sonuçları ve ekli görseller ExcalidrawZ AI hizmetlerine ve OpenAI, Anthropic ve Google gibi üçüncü taraf model sağlayıcılarına, seçilen modele bağlı olarak gönderilebilir.
vi: AI là một tính năng đám mây. Khi bạn sử dụng nó, yêu cầu của bạn, nội dung canvas liên quan, kết quả công cụ và các hình ảnh đính kèm có thể được gửi đến dịch vụ AI của ExcalidrawZ và các nhà cung cấp mô hình bên thứ ba như OpenAI, Anthropic và Google, tùy thuộc vào mô hình đã chọn.
zh_hans: AI是一个云功能。当您使用它时，您的提示、相关画布内容、工具结果和附加图片可能会根据所选模型发送到ExcalidrawZ AI服务和第三方模型提供者，如OpenAI、Anthropic和Google。
zh_hant: AI 是一項雲端功能。當您使用它時，您的提示、相關的畫布內容、工具結果和附加圖像可能會根據選擇的模型，發送到 ExcalidrawZ AI 服務及第三方模型提供商，例如 OpenAI、Anthropic 和 Google。

# aiChatEnableConfirmationTitle
source: Enable AI features?
ar: هل تريد تفعيل ميزات الذكاء الاصطناعي؟
de: AI-Funktionen aktivieren?
es: ¿Habilitar funciones de IA?
fr: Activer les fonctionnalités AI ?
hi: AI सुविधाएँ सक्षम करें?
it: Abilitare le funzionalità AI?
ja: AI機能を有効にしますか？
ko: AI 기능을 활성화하시겠습니까?
nl: AI-functies inschakelen?
pl: Włączyć funkcje AI?
pt: Ativar recursos de IA?
ru: Включить функции ИИ?
th: ต้องการเปิดใช้งานฟีเจอร์ AI หรือไม่?
tr: AI özelliklerini etkinleştirmek istiyor musunuz?
vi: Có bật tính năng AI không?
zh_hans: 启用AI功能？
zh_hant: 要啟用 AI 功能嗎？
